Public Member Functions | List of all members
API_PropertyConversionUtilsInterface Class Referenceabstract
Property Manager
#include <APIdefs_Properties.h>
 Public Member Functions
virtual  | ~API_PropertyConversionUtilsInterface ()=default
virtual const GS::UniString &  | GetDegreeSymbol1 () const =0
virtual const GS::UniString &  | GetDegreeSymbol2 () const =0
virtual const GS::UniString &  | GetMinuteSymbol () const =0
virtual const GS::UniString &  | GetSecondSymbol () const =0
virtual const GS::UniString &  | GetGradientSymbol () const =0
virtual const GS::UniString &  | GetRadianSymbol () const =0
virtual const GS::UniString &  | GetNorthSymbol () const =0
virtual const GS::UniString &  | GetSouthSymbol () const =0
virtual const GS::UniString &  | GetEastSymbol () const =0
virtual const GS::UniString &  | GetWestSymbol () const =0
virtual GS::uchar_t  | GetDecimalDelimiterChar () const =0
virtual GS::Optional< GS::UniChar >  | GetThousandSeparatorChar () const =0
virtual API_LengthTypeID  | GetLengthType () const =0
virtual API_AreaTypeID  | GetAreaType () const =0
virtual API_VolumeTypeID  | GetVolumeType () const =0
virtual API_AngleTypeID  | GetAngleType () const =0
Detailed Description
An interface for getting units of measurement for string to property value conversion. The class which implements the interface has to return the appropriate units of measurement and delimiters. It is only used for ACAPI_Property_SetPropertyValueFromString.
Since
Archicad 25
Remarks
Interface class for passing in the desired units of measurement to ACAPI_Property_SetPropertyValueFromString. For a detailed example see the Property_Test test add-on.
Constructor & Destructor Documentation
◆ ~API_PropertyConversionUtilsInterface()
 virtual API_PropertyConversionUtilsInterface::~API_PropertyConversionUtilsInterface  |  ( |   | )
virtualdefault
Member Function Documentation
◆ GetAngleType()
 virtual API_AngleTypeID API_PropertyConversionUtilsInterface::GetAngleType  |  ( |   | ) |   const
pure virtual
◆ GetAreaType()
 virtual API_AreaTypeID API_PropertyConversionUtilsInterface::GetAreaType  |  ( |   | ) |   const
pure virtual
◆ GetDecimalDelimiterChar()
 virtual GS::uchar_t API_PropertyConversionUtilsInterface::GetDecimalDelimiterChar  |  ( |   | ) |   const
pure virtual
◆ GetDegreeSymbol1()
 virtual const GS::UniString & API_PropertyConversionUtilsInterface::GetDegreeSymbol1  |  ( |   | ) |   const
pure virtual
◆ GetDegreeSymbol2()
 virtual const GS::UniString & API_PropertyConversionUtilsInterface::GetDegreeSymbol2  |  ( |   | ) |   const
pure virtual
◆ GetEastSymbol()
 virtual const GS::UniString & API_PropertyConversionUtilsInterface::GetEastSymbol  |  ( |   | ) |   const
pure virtual
◆ GetGradientSymbol()
 virtual const GS::UniString & API_PropertyConversionUtilsInterface::GetGradientSymbol  |  ( |   | ) |   const
pure virtual
◆ GetLengthType()
 virtual API_LengthTypeID API_PropertyConversionUtilsInterface::GetLengthType  |  ( |   | ) |   const
pure virtual
◆ GetMinuteSymbol()
 virtual const GS::UniString & API_PropertyConversionUtilsInterface::GetMinuteSymbol  |  ( |   | ) |   const
pure virtual
◆ GetNorthSymbol()
 virtual const GS::UniString & API_PropertyConversionUtilsInterface::GetNorthSymbol  |  ( |   | ) |   const
pure virtual
◆ GetRadianSymbol()
 virtual const GS::UniString & API_PropertyConversionUtilsInterface::GetRadianSymbol  |  ( |   | ) |   const
pure virtual
◆ GetSecondSymbol()
 virtual const GS::UniString & API_PropertyConversionUtilsInterface::GetSecondSymbol  |  ( |   | ) |   const
pure virtual
◆ GetSouthSymbol()
 virtual const GS::UniString & API_PropertyConversionUtilsInterface::GetSouthSymbol  |  ( |   | ) |   const
pure virtual
◆ GetThousandSeparatorChar()
 virtual GS::Optional< GS::UniChar > API_PropertyConversionUtilsInterface::GetThousandSeparatorChar  |  ( |   | ) |   const
pure virtual
◆ GetVolumeType()
 virtual API_VolumeTypeID API_PropertyConversionUtilsInterface::GetVolumeType  |  ( |   | ) |   const
pure virtual
◆ GetWestSymbol()
 virtual const GS::UniString & API_PropertyConversionUtilsInterface::GetWestSymbol  |  ( |   | ) |   const
pure virtual